In [8]:
import pandas as pd
students_data = {
    "Student_ID": [101, 102, 103, 104, 105, 106, 107],
    "Name": ["Aman", "Bhavna", "Chirag", "Divya", "Eshan", "Fatima", "Gaurav"],
    "Maths": [87, 78, 90, 66, 92, 81, 74],
    "Science": [82, 69, 85, 70, 89, 76, 80],
    "English": [75, 88, 79, 91, 73, 85, 68],
    "Attendance(%)": [95, 88, 90, 92, 85, 93, 87]
}
data_df=pd.DataFrame(students_data,index=None,columns=None)
data_df

   Student_ID    Name  Maths  Science  English  Attendance(%)
0         101    Aman     87       82       75             95
1         102  Bhavna     78       69       88             88
2         103  Chirag     90       85       79             90
3         104   Divya     66       70       91             92
4         105   Eshan     92       89       73             85
5         106  Fatima     81       76       85             93
6         107  Gaurav     74       80       68             87

In [13]:
data_df.columns

Index(['Student_ID', 'Name', 'Maths', 'Science', 'English', 'Attendance(%)'], dtype='object')

In [15]:
data_df.index

RangeIndex(start=0, stop=7, step=1)

In [20]:
data_df["Maths"].describe().reset_index()

   index      Maths
0  count   7.000000
1   mean  81.142857
2    std   9.317163
3    min  66.000000
4    25%  76.000000
5    50%  81.000000
6    75%  88.500000
7    max  92.000000

In [21]:
data_df.describe().reset_index()

   index  Student_ID      Maths    Science    English  Attendance(%)
0  count    7.000000   7.000000   7.000000   7.000000       7.000000
1   mean  104.000000  81.142857  78.714286  79.857143      90.000000
2    std    2.160247   9.317163   7.476949   8.454359       3.559026
3    min  101.000000  66.000000  69.000000  68.000000      85.000000
4    25%  102.500000  76.000000  73.000000  74.000000      87.500000
5    50%  104.000000  81.000000  80.000000  79.000000      90.000000
6    75%  105.500000  88.500000  83.500000  86.500000      92.500000
7    max  107.000000  92.000000  89.000000  91.000000      95.000000

In [22]:
data_df["Maths"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 7 entries, 0 to 6
Series name: Maths
Non-Null Count  Dtype
--------------  -----
7 non-null      int64
dtypes: int64(1)
memory usage: 188.0 bytes

In [23]:
data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Student_ID     7 non-null      int64
 1   Name           7 non-null      object
 2   Maths          7 non-null      int64
 3   Science        7 non-null      int64
 4   English        7 non-null      int64
 5   Attendance(%)  7 non-null      int64
dtypes: int64(5), object(1)
memory usage: 468.0+ bytes

In [24]:
data_df.ndim

2

In [25]:
data_df["Name"].ndim

1

In [26]:
data_df.shape

(7, 6)

In [27]:
data_df["Science"].shape

(7,)

In [32]:
data_df.dtype

AttributeError: 'DataFrame' object has no attribute 'dtype'

In [31]:
data_df["Name"].dtype

dtype('O')

In [36]:
data=data_df["English"].astype("int8")
data

0    75
1    88
2    79
3    91
4    73
5    85
6    68
Name: English, dtype: int8

In [37]:
data_df.head(2)

   Student_ID    Name  Maths  Science  English  Attendance(%)
0         101    Aman     87       82       75             95
1         102  Bhavna     78       69       88             88

In [38]:
data_df.tail(3)

   Student_ID    Name  Maths  Science  English  Attendance(%)
4         105   Eshan     92       89       73             85
5         106  Fatima     81       76       85             93
6         107  Gaurav     74       80       68             87

In [43]:
data=data_df.nunique()
data

Student_ID       7
Name             7
Maths            7
Science          7
English          7
Attendance(%)    7
dtype: int64

In [44]:
data=data_df["Maths"].nunique()
data

7

In [47]:
data_df["Science"].unique()

array([82, 69, 85, 70, 89, 76, 80])

In [48]:
data_df["English"].unique

<bound method Series.unique of 0    75
1    88
2    79
3    91
4    73
5    85
6    68
Name: English, dtype: int64>

In [45]:
data_df

   Student_ID    Name  Maths  Science  English  Attendance(%)
0         101    Aman     87       82       75             95
1         102  Bhavna     78       69       88             88
2         103  Chirag     90       85       79             90
3         104   Divya     66       70       91             92
4         105   Eshan     92       89       73             85
5         106  Fatima     81       76       85             93
6         107  Gaurav     74       80       68             87

In [52]:
data=data_df.agg(("sum","min","max"))
data

,Student_ID,Name,Maths,Science,English,Attendance(%)
sum,728,AmanBhavnaChiragDivyaEshanFatimaGaurav,568,551,559,630
min,101,Aman,66,69,68,85
max,107,Gaurav,92,89,91,95

In [55]:
data_df["Maths"].agg(("sum","mean","min")).reset_index()

  index       Maths
0   sum  568.000000
1  mean   81.142857
2   min   66.000000

In [61]:
data_df.loc[[0,1],["Science","Maths"]]

   Science  Maths
0       82     87
1       69     78

In [74]:
data_df.loc[[0,1,2,3],["Name"]]

  Name
0   90
1   90
2   90
3   90

In [84]:
data_df.loc[[1,2,3,4],["Science"]]

   Science
1       20
2       20
3       20
4       20

In [86]:
data_df.loc[[False,True,False,True,False,True,True]]

   Student_ID    Name  Maths  Science  English  Attendance(%)
1         102    Name     90       20       90             88
3         104    Name     90       20       90             92
5         106  Fatima     81       76       85             93
6         107  Gaurav     74       80       68             87

In [87]:
data_df.loc[data_df["Maths"]>90]

   Student_ID  Name  Maths  Science  English  Attendance(%)
4         105  Name     92       20       73             85

In [89]:
data_df.loc[(data_df["Science"]>76) & (data_df["English"]>73)]

   Student_ID Name  Maths  Science  English  Attendance(%)
0         101   90     90       90       90             95

In [91]:
data_df.loc[(data_df["Maths"]>81)&(data_df["English"]>73)]

   Student_ID  Name  Maths  Science  English  Attendance(%)
0         101    90     90       90       90             95
1         102  Name     90       20       90             88
2         103  Name     90       20       90             90
3         104  Name     90       20       90             92

In [92]:
data_df.iloc[0]

Student_ID       101
Name              90
Maths             90
Science           90
English           90
Attendance(%)     95
Name: 0, dtype: object

In [99]:
data_df.iloc[[0,1,3],[2,3]]

   Maths  Science
0     90       90
1     90       20
3     90       20

In [104]:
data=data_df.iloc[1,5]=24
data_df

   Student_ID    Name  Maths  Science  English  Attendance(%)
0         101      90     90       90       90             95
1         102    Name     90       20       90             24
2         103    Name     90       20       90             90
3         104    Name     90       20       90             92
4         105    Name     92       20       73             85
5         106  Fatima     81       76       85             93
6         107  Gaurav     74       80       68             87

In [108]:
data_df.iloc[0]

Student_ID       101
Name              90
Maths             90
Science           90
English           90
Attendance(%)     95
Name: 0, dtype: object

In [109]:
data_df.iloc[[0]]

   Student_ID Name  Maths  Science  English  Attendance(%)
0         101   90     90       90       90             95

In [111]:
data_df.iloc[[1,2]]

   Student_ID  Name  Maths  Science  English  Attendance(%)
1         102  Name     90       20       90             24
2         103  Name     90       20       90             90

In [112]:
data_df.iloc[:2]

   Student_ID  Name  Maths  Science  English  Attendance(%)
0         101    90     90       90       90             95
1         102  Name     90       20       90             24

In [115]:
data_df.iloc[:2,:3]

   Student_ID  Name  Maths
0         101    90     90
1         102  Name     90

In [117]:
data_df.iloc[[True,False,True,True,False,False,False]]

   Student_ID  Name  Maths  Science  English  Attendance(%)
0         101    90     90       90       90             95
2         103  Name     90       20       90             90
3         104  Name     90       20       90             92

In [118]:
data=data_df.groupby("Name")["Maths"].sum().reset_index()
data

     Name  Maths
0      90     90
1  Fatima     81
2  Gaurav     74
3    Name    362

In [122]:
data1=data_df["Maths"].rolling(window=2).sum().reset_index()
data1

   index  Maths
0      0    NaN
1      1  180.0
2      2  180.0
3      3  180.0
4      4  182.0
5      5  173.0
6      6  155.0

In [123]:
data2=data_df.rename(columns={"Name":"Students","Student_ID":"ROll_No"})
data2

   ROll_No Students  Maths  Science  English  Attendance(%)
0      101       90     90       90       90             95
1      102     Name     90       20       90             24
2      103     Name     90       20       90             90
3      104     Name     90       20       90             92
4      105     Name     92       20       73             85
5      106   Fatima     81       76       85             93
6      107   Gaurav     74       80       68             87

In [105]:
data_df

   Student_ID    Name  Maths  Science  English  Attendance(%)
0         101      90     90       90       90             95
1         102    Name     90       20       90             24
2         103    Name     90       20       90             90
3         104    Name     90       20       90             92
4         105    Name     92       20       73             85
5         106  Fatima     81       76       85             93
6         107  Gaurav     74       80       68             87

In [124]:
ind=["01","02","03","04","05","06","07"]
data1=pd.DataFrame(data_df,index=ind)
data1

    Student_ID Name  Maths  Science  English  Attendance(%)
01         NaN  NaN    NaN      NaN      NaN            NaN
02         NaN  NaN    NaN      NaN      NaN            NaN
03         NaN  NaN    NaN      NaN      NaN            NaN
04         NaN  NaN    NaN      NaN      NaN            NaN
05         NaN  NaN    NaN      NaN      NaN            NaN
06         NaN  NaN    NaN      NaN      NaN            NaN
07         NaN  NaN    NaN      NaN      NaN            NaN

In [126]:
data1.dropna()

Empty DataFrame
Columns: [Student_ID, Name, Maths, Science, English, Attendance(%)]
Index: []

In [127]:
data1

    Student_ID Name  Maths  Science  English  Attendance(%)
01         NaN  NaN    NaN      NaN      NaN            NaN
02         NaN  NaN    NaN      NaN      NaN            NaN
03         NaN  NaN    NaN      NaN      NaN            NaN
04         NaN  NaN    NaN      NaN      NaN            NaN
05         NaN  NaN    NaN      NaN      NaN            NaN
06         NaN  NaN    NaN      NaN      NaN            NaN
07         NaN  NaN    NaN      NaN      NaN            NaN

In [128]:
data1.fillna(0)

C:\Users\talib\AppData\Local\Temp\ipykernel_24296\3703244422.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  data1.fillna(0)

    Student_ID  Name  Maths  Science  English  Attendance(%)
01         0.0     0    0.0      0.0      0.0            0.0
02         0.0     0    0.0      0.0      0.0            0.0
03         0.0     0    0.0      0.0      0.0            0.0
04         0.0     0    0.0      0.0      0.0            0.0
05         0.0     0    0.0      0.0      0.0            0.0
06         0.0     0    0.0      0.0      0.0            0.0
07         0.0     0    0.0      0.0      0.0            0.0

In [133]:
data1["Name"].fillna("Unknown").reset_index()

  index     Name
0    01  Unknown
1    02  Unknown
2    03  Unknown
3    04  Unknown
4    05  Unknown
5    06  Unknown
6    07  Unknown

In [134]:
data1

    Student_ID Name  Maths  Science  English  Attendance(%)
01         NaN  NaN    NaN      NaN      NaN            NaN
02         NaN  NaN    NaN      NaN      NaN            NaN
03         NaN  NaN    NaN      NaN      NaN            NaN
04         NaN  NaN    NaN      NaN      NaN            NaN
05         NaN  NaN    NaN      NaN      NaN            NaN
06         NaN  NaN    NaN      NaN      NaN            NaN
07         NaN  NaN    NaN      NaN      NaN            NaN

In [125]:
data_df

   Student_ID    Name  Maths  Science  English  Attendance(%)
0         101      90     90       90       90             95
1         102    Name     90       20       90             24
2         103    Name     90       20       90             90
3         104    Name     90       20       90             92
4         105    Name     92       20       73             85
5         106  Fatima     81       76       85             93
6         107  Gaurav     74       80       68             87

In [135]:
data_df.to_csv("Students_details.csv",index=False)

In [138]:
data_df.to_csv("C:\\Users\\talib\\Downloads\\Students_details.csv",index=False)

In [139]:
data2=pd.read_csv("C:\\Users\\talib\\Downloads\\Students_details.csv",index_col=0)

In [140]:
data2

              Name  Maths  Science  English  Attendance(%)
Student_ID
101             90     90       90       90             95
102           Name     90       20       90             24
103           Name     90       20       90             90
104           Name     90       20       90             92
105           Name     92       20       73             85
106         Fatima     81       76       85             93
107         Gaurav     74       80       68             87

In [142]:
import pandas as pd
sales_data = {
    "Product_ID": ["P001", "P002", "P003", "P004", "P005", "P006", "P007"],
    "Product_Name": ["Soap", "Shampoo", "Toothpaste", "Lotion", "Oil", "Cream", "Powder"],
    "Price": [30, 120, 80, 150, 95, 60, 40],
    "Units_Sold": [500, 300, 450, 200, 400, 350, 250],
    "Category": ["Bath", "Hair", "Oral", "Skin", "Hair", "Skin", "Bath"],
    "Discount(%)": [5, 10, 7, 15, 12, 8, 5]
}
sales_df=pd.DataFrame(sales_data)
sales_df

  Product_ID Product_Name  Price  Units_Sold Category  Discount(%)
0       P001         Soap     30         500     Bath            5
1       P002      Shampoo    120         300     Hair           10
2       P003   Toothpaste     80         450     Oral            7
3       P004       Lotion    150         200     Skin           15
4       P005          Oil     95         400     Hair           12
5       P006        Cream     60         350     Skin            8
6       P007       Powder     40         250     Bath            5

In [143]:
sales_df.describe()

            Price  Units_Sold  Discount(%)
count    7.000000    7.000000     7.000000
mean    82.142857  350.000000     8.857143
std     43.191159  108.012345     3.716117
min     30.000000  200.000000     5.000000
25%     50.000000  275.000000     6.000000
50%     80.000000  350.000000     8.000000
75%    107.500000  425.000000    11.000000
max    150.000000  500.000000    15.000000

In [144]:
sales_df["Price"].describe()

count      7.000000
mean      82.142857
std       43.191159
min       30.000000
25%       50.000000
50%       80.000000
75%      107.500000
max      150.000000
Name: Price, dtype: float64

In [145]:
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Product_ID    7 non-null      object
 1   Product_Name  7 non-null      object
 2   Price         7 non-null      int64
 3   Units_Sold    7 non-null      int64
 4   Category      7 non-null      object
 5   Discount(%)   7 non-null      int64
dtypes: int64(3), object(3)
memory usage: 468.0+ bytes

In [146]:
sales_df["Price"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 7 entries, 0 to 6
Series name: Price
Non-Null Count  Dtype
--------------  -----
7 non-null      int64
dtypes: int64(1)
memory usage: 188.0 bytes

In [147]:
sales_df.head(2)

  Product_ID Product_Name  Price  Units_Sold Category  Discount(%)
0       P001         Soap     30         500     Bath            5
1       P002      Shampoo    120         300     Hair           10

In [148]:
sales_df.tail(3)

  Product_ID Product_Name  Price  Units_Sold Category  Discount(%)
4       P005          Oil     95         400     Hair           12
5       P006        Cream     60         350     Skin            8
6       P007       Powder     40         250     Bath            5

In [150]:
sales_df["Price"].ndim

1

In [151]:
sales_df.ndim

2

In [152]:
sales_df.shape

(7, 6)

In [153]:
sales_df["Price"].shape

(7,)

In [154]:
sales_df.size

42

In [155]:
sales_df["Price"].size

7

In [158]:
sales_df["Price"].dtype

dtype('int64')

In [159]:
sales_df["Price"].array

<NumpyExtensionArray>
[ np.int64(30), np.int64(120),  np.int64(80), np.int64(150),  np.int64(95),
  np.int64(60),  np.int64(40)]
Length: 7, dtype: int64

In [160]:
sales_df["Price"].astype("int8")

0     30
1    120
2     80
3   -106
4     95
5     60
6     40
Name: Price, dtype: int8

In [162]:
sales_df["Price"].agg(("sum","min","max"))

sum    575
min     30
max    150
Name: Price, dtype: int64

In [164]:
sales=sales_df.groupby("Product_Name")["Price"].sum().reset_index()
sales

  Product_Name  Price
0        Cream     60
1       Lotion    150
2          Oil     95
3       Powder     40
4      Shampoo    120
5         Soap     30
6   Toothpaste     80

In [167]:
sale2=sales_df["Price"].rolling(window=2).sum().reset_index()
sale2

   index  Price
0      0    NaN
1      1  150.0
2      2  200.0
3      3  230.0
4      4  245.0
5      5  155.0
6      6  100.0

In [168]:
sales_df.nunique()

Product_ID      7
Product_Name    7
Price           7
Units_Sold      7
Category        4
Discount(%)     6
dtype: int64

In [172]:
sales_df["Discount(%)"].unique()

array([ 5, 10,  7, 15, 12,  8])

In [173]:
sales_df.columns

Index(['Product_ID', 'Product_Name', 'Price', 'Units_Sold', 'Category',
       'Discount(%)'],
      dtype='object')

In [174]:
sales_df.index

RangeIndex(start=0, stop=7, step=1)

In [175]:
sales_df["Price"].index

RangeIndex(start=0, stop=7, step=1)

In [176]:
sales_df.rename(columns={"ID","Name"})

TypeError: 'set' object is not callable

In [177]:
sales_df.rename(columns={"Product_ID":"ID","Product_Name":"Name"})

     ID        Name  Price  Units_Sold Category  Discount(%)
0  P001        Soap     30         500     Bath            5
1  P002     Shampoo    120         300     Hair           10
2  P003  Toothpaste     80         450     Oral            7
3  P004      Lotion    150         200     Skin           15
4  P005         Oil     95         400     Hair           12
5  P006       Cream     60         350     Skin            8
6  P007      Powder     40         250     Bath            5

In [178]:
idx=["01","02","03","04","04","05","06","07"]
sale3=pd.DataFrame(sales_df,index=idx)
sale3

   Product_ID Product_Name  Price  Units_Sold Category  Discount(%)
01        NaN          NaN    NaN         NaN      NaN          NaN
02        NaN          NaN    NaN         NaN      NaN          NaN
03        NaN          NaN    NaN         NaN      NaN          NaN
04        NaN          NaN    NaN         NaN      NaN          NaN
04        NaN          NaN    NaN         NaN      NaN          NaN
05        NaN          NaN    NaN         NaN      NaN          NaN
06        NaN          NaN    NaN         NaN      NaN          NaN
07        NaN          NaN    NaN         NaN      NaN          NaN

In [179]:
sale3.dropna()

Empty DataFrame
Columns: [Product_ID, Product_Name, Price, Units_Sold, Category, Discount(%)]
Index: []

In [180]:
sale3

   Product_ID Product_Name  Price  Units_Sold Category  Discount(%)
01        NaN          NaN    NaN         NaN      NaN          NaN
02        NaN          NaN    NaN         NaN      NaN          NaN
03        NaN          NaN    NaN         NaN      NaN          NaN
04        NaN          NaN    NaN         NaN      NaN          NaN
04        NaN          NaN    NaN         NaN      NaN          NaN
05        NaN          NaN    NaN         NaN      NaN          NaN
06        NaN          NaN    NaN         NaN      NaN          NaN
07        NaN          NaN    NaN         NaN      NaN          NaN

In [181]:
sale3["Price"].dropna()

Series([], Name: Price, dtype: float64)

In [182]:
sale3.fillna(0)

C:\Users\talib\AppData\Local\Temp\ipykernel_24296\4235113140.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  sale3.fillna(0)

    Product_ID  Product_Name  Price  Units_Sold  Category  Discount(%)
01           0             0    0.0         0.0         0          0.0
02           0             0    0.0         0.0         0          0.0
03           0             0    0.0         0.0         0          0.0
04           0             0    0.0         0.0         0          0.0
04           0             0    0.0         0.0         0          0.0
05           0             0    0.0         0.0         0          0.0
06           0             0    0.0         0.0         0          0.0
07           0             0    0.0         0.0         0          0.0

In [183]:
sales_df

  Product_ID Product_Name  Price  Units_Sold Category  Discount(%)
0       P001         Soap     30         500     Bath            5
1       P002      Shampoo    120         300     Hair           10
2       P003   Toothpaste     80         450     Oral            7
3       P004       Lotion    150         200     Skin           15
4       P005          Oil     95         400     Hair           12
5       P006        Cream     60         350     Skin            8
6       P007       Powder     40         250     Bath            5

In [184]:
sales_df.loc[0,"Price"]

np.int64(30)

In [188]:
sales_df.loc[[0,1]]

  Product_ID Product_Name  Price  Units_Sold Category  Discount(%)
0       P001         Soap     30         500     Bath            5
1       P002      Shampoo    120         300     Hair           10

In [189]:
sales_df.loc[[1,2],["Price","Category"]]

   Price Category
1    120     Hair
2     80     Oral

In [190]:
sales_df.loc[(sales_df["Price"]>95)]

  Product_ID Product_Name  Price  Units_Sold Category  Discount(%)
1       P002      Shampoo    120         300     Hair           10
3       P004       Lotion    150         200     Skin           15

In [191]:
sales_df.loc[[1],["Price"]]=200

In [192]:
sales_df

  Product_ID Product_Name  Price  Units_Sold Category  Discount(%)
0       P001         Soap     30         500     Bath            5
1       P002      Shampoo    200         300     Hair           10
2       P003   Toothpaste     80         450     Oral            7
3       P004       Lotion    150         200     Skin           15
4       P005          Oil     95         400     Hair           12
5       P006        Cream     60         350     Skin            8
6       P007       Powder     40         250     Bath            5

In [193]:
sales_df.loc["Price"]

KeyError: 'Price'

In [194]:
sales_df.loc[["Price"]]

KeyError: "None of [Index(['Price'], dtype='object')] are in the [index]"

In [195]:
sales_df.loc[[True,False,False,False,False,False,False]]

  Product_ID Product_Name  Price  Units_Sold Category  Discount(%)
0       P001         Soap     30         500     Bath            5

In [196]:
sales_df.loc[1]

Product_ID         P002
Product_Name    Shampoo
Price               200
Units_Sold          300
Category           Hair
Discount(%)          10
Name: 1, dtype: object

In [203]:
sales_df.loc[1,"Category"]

'Hair'

In [199]:

sales_df.iloc[0]

Product_ID      P001
Product_Name    Soap
Price             30
Units_Sold       500
Category        Bath
Discount(%)        5
Name: 0, dtype: object

In [200]:
sales_df.iloc[0,1]

'Soap'

In [201]:
sales_df.iloc[[0,1]]

  Product_ID Product_Name  Price  Units_Sold Category  Discount(%)
0       P001         Soap     30         500     Bath            5
1       P002      Shampoo    200         300     Hair           10

In [204]:
sales_df.iloc[[0,2],[2,3]]

   Price  Units_Sold
0     30         500
2     80         450

In [205]:
sales_df.iloc[[1,2]]

  Product_ID Product_Name  Price  Units_Sold Category  Discount(%)
1       P002      Shampoo    200         300     Hair           10
2       P003   Toothpaste     80         450     Oral            7

In [206]:
sales_df.iloc[[1,2]]=10

In [207]:
sales_df

  Product_ID Product_Name  Price  Units_Sold Category  Discount(%)
0       P001         Soap     30         500     Bath            5
1         10           10     10          10       10           10
2         10           10     10          10       10           10
3       P004       Lotion    150         200     Skin           15
4       P005          Oil     95         400     Hair           12
5       P006        Cream     60         350     Skin            8
6       P007       Powder     40         250     Bath            5

In [216]:
sales_df.to_csv("shop_details.csv",index=False)

In [217]:
sales_df.to_json("shop_details.json",index=False)

In [218]:
sales_df.to_excel("shop_details.xlsx",index=False)

In [219]:
sales_df.to_csv("C:\\Users\\talib\\Downloads\\shop_details.csv",index=False)

In [220]:
sales_df.to_json("C:\\Users\\talib\\Downloads\\shop_details.json",index=False)

In [221]:
sales_df.to_excel("C:\\Users\\talib\\Downloads\\shop_details.xlsx",index=False)

In [222]:
sale1=pd.read_csv("shop_details.csv",index_col=0)
sale1

           Product_Name  Price  Units_Sold Category  Discount(%)
Product_ID
P001               Soap     30         500     Bath            5
10                   10     10          10       10           10
10                   10     10          10       10           10
P004             Lotion    150         200     Skin           15
P005                Oil     95         400     Hair           12
P006              Cream     60         350     Skin            8
P007             Powder     40         250     Bath            5

In [224]:
sale2=pd.read_json("shop_details.json")
sale2

  Product_ID Product_Name  Price  Units_Sold Category  Discount(%)
0       P001         Soap     30         500     Bath            5
1         10           10     10          10       10           10
2         10           10     10          10       10           10
3       P004       Lotion    150         200     Skin           15
4       P005          Oil     95         400     Hair           12
5       P006        Cream     60         350     Skin            8
6       P007       Powder     40         250     Bath            5

In [225]:
sale3=pd.read_excel("shop_details.xlsx",index_col=0)
sale3

           Product_Name  Price  Units_Sold Category  Discount(%)
Product_ID
P001               Soap     30         500     Bath            5
10                   10     10          10       10           10
10                   10     10          10       10           10
P004             Lotion    150         200     Skin           15
P005                Oil     95         400     Hair           12
P006              Cream     60         350     Skin            8
P007             Powder     40         250     Bath            5

In [227]:
sale4=pd.read_csv(r"C:\Users\talib\Downloads\shop_details.csv",index_col=0)
sale4

           Product_Name  Price  Units_Sold Category  Discount(%)
Product_ID
P001               Soap     30         500     Bath            5
10                   10     10          10       10           10
10                   10     10          10       10           10
P004             Lotion    150         200     Skin           15
P005                Oil     95         400     Hair           12
P006              Cream     60         350     Skin            8
P007             Powder     40         250     Bath            5

In [230]:
sale5=pd.read_json(r"C:\Users\talib\Downloads\shop_details.json")
sale5

  Product_ID Product_Name  Price  Units_Sold Category  Discount(%)
0       P001         Soap     30         500     Bath            5
1         10           10     10          10       10           10
2         10           10     10          10       10           10
3       P004       Lotion    150         200     Skin           15
4       P005          Oil     95         400     Hair           12
5       P006        Cream     60         350     Skin            8
6       P007       Powder     40         250     Bath            5

In [231]:
sale6=pd.read_excel(r"C:\Users\talib\Downloads\shop_details.xlsx",index_col=0)
sale6

           Product_Name  Price  Units_Sold Category  Discount(%)
Product_ID
P001               Soap     30         500     Bath            5
10                   10     10          10       10           10
10                   10     10          10       10           10
P004             Lotion    150         200     Skin           15
P005                Oil     95         400     Hair           12
P006              Cream     60         350     Skin            8
P007             Powder     40         250     Bath            5

In [3]:
import pandas as pd
import os
os.getcwd()

'C:\\Users\\talib'

In [6]:
os.chdir("Downloads")

In [7]:
os.getcwd()

'C:\\Users\\talib\\Downloads'

In [11]:
os.listdir()

['(17) GATE-CS_IT Details _ Eligibility _ Syllabus _ Subjects _ Weightage _ Vishvadeep Gothi - YouTube_files',
 '01_Python_Set01_Complete_Problem (1).zip',
 '01_Python_Set01_Complete_Problem (2).zip',
 '01_Python_Set01_Complete_Problem.zip',
 '10_01_Aug_2025_02_Aug_2025_2_Coding_Set_lists_sets_tuples.ipynb',
 '16_july_2025_example01.ipynb',
 '22_07_2025_Introduction_Strings_functions.ipynb',
 '23_July_2025_02_Lists_Introduction.ipynb',
 '2_16_July_2025_Lesson02_example01.ipynb',
 '3_18july_2025_Lesson_03_PythonProgramming03.ipynb',
 '4100e792-5c89-44eb-bfc3-1ca3aa6a0ca0.png',
 '4_21_july_2025_O1_Introduction_CodingInterview_Problems (1).ipynb',
 '4_21_july_2025_O1_Introduction_CodingInterview_Problems.ipynb',
 '6208435085783450327.jpg',
 '6291851974966100074.jpg',
 '6291851974966100075.jpg',
 '65c7381571938981dff646db.pdf',
 '6_24_july_26_July_2025_Lesson04_Set_Tuple_Dictionary.ipynb',
 '7_29_july_2025_Lesson05_Basics_functions.ipynb',
 '8_30_July_2025_02_Python_Packing_Unpacking_Examples_copy.ipynb',
 '9168607.pdf',
 '9_31_july_2025_03_Python_Functions_Variable_Scope_and_Lambda.ipynb',
 'ADMIT CARD.pdf',
 'Ai Code Generator Design (1).pdf',
 'Ai Code Generator Design.pdf',
 'AI-Powered Legal Chatbot (1).pptx',
 'AI-Powered Legal Chatbot.pptx',
 'AI_Code_Generator_Development_Plan.pdf',
 'ai_code_generator_gantt_chart (1).png',
 'ai_code_generator_gantt_chart.png',
 'Anaconda3-2025.06-0-Windows-x86_64.exe',
 'android-x86_64-8.1-r6.iso',
 'Animations & Responsiveness - Class I [Codes].zip',
 'annual subscription.pdf',
 'Array List Class.pdf',
 'AsQ Stack 2.pdf',
 'Assignment2.docx',
 'Basic (1).pdf',
 'Basic Sorting Algorithms.pdf',
 'Basic.pdf',
 'Basics.pdf',
 "BEGINNER'S CODING SHEET.pdf",
 'Best guide to prepare DSA.pdf',
 'Binery Search.pdf',
 'BST 2 (2).pdf',
 'BST 3.pdf',
 'BST-1 Java.pdf',
 'Business-Model-Freemium-with-Premium-Upsells.png',
 'Certificate JAVA+DSA.pdf',
 'ChatGPT Image Aug 1, 2025, 09_41_09 PM.png',
 'ChatGPT Image Jul 30, 2025, 10_36_43 PM.png',
 'choicefilling.pdf',
 'Chrome Extention.pdf',
 'chrome.exe',
 'ChromeSetup.exe',
 'CN_in_5_hours__1__lyst1728638374203.pdf',
 'coachingpracticeproblem.html',
 'coachingpracticeproblem.ipynb',
 'COLLEGE SYLLBUS.pdf',
 'Company Wise DSA Materials-20241029T035339Z-001.zip',
 'Compiler_in_7_Hours_lyst1728638668080.pdf',
 'Conditionals.pdf',
 'Conditionals_LP.pdf',
 'Conditions (1).pdf',
 'Conditions.pdf',
 'Corruption HNA.pdf',
 'Crack Any Product Based Company .pdf',
 'cricket_details.csv',
 'CSS Basics - III [Class Codes].zip',
 'CSS Basics.zip',
 'CSS Cheatsheet.pdf',
 'CSS Debug Exercise.zip',
 'css.notes.pdf',
 'Current Affairs by Anand Sir 09.12.24.pdf',
 'DAS Notes.pdf',
 'Data Structure And Algorithms .pdf',
 'DBMS_Notes.pdf',
 'desktop.ini',
 'DocScanner May 12, 2024 8-42 PM.pdf',
 'DocScanner May 19, 2024 3-21 PM.pdf',
 'download.pdf',
 'download.png',
 'DP 2 (1).pdf',
 'dp 3.pdf',
 'DP 4.pdf',
 'DP 5.pdf',
 'DP-6 (1).pdf',
 'DP-6 (2).pdf',
 'drive-download-20241029T035740Z-001.zip',
 'DSA - Real World Examples.pdf',
 'DSA PATTERNS.pdf',
 'Dynamic Programming -1 (1).pdf',
 'Dynamic Programming -2 (2).pdf',
 'Dynamic Programming -3 (1).pdf',
 'Dynamic Programming -4 (2).pdf',
 'Dynamic Programming -5 (1).pdf',
 'E-Library_Startup_Presentation (1).pdf',
 'E-Library_Startup_Presentation.pdf',
 'EduNest-Indias-Most-Complete-Digital-Study-Hub.png',
 'EduNest_E_Library_Presentation (1).pptx',
 'EduNest_E_Library_Presentation.pptx',
 'English Grammar.pdf',
 'Every-Citys-Story-Broken-Roads-Absent-Ground-Reports.pdf',
 'exam fee receipt.pdf',
 'Exercise1 - HTML.zip',
 'fee receipt of exam form.pdf',
 'file1.txt',
 'FINAL450.xlsx',
 'Final_NyayaBot_Project_Report_Abbu_Talib_Ansari.pdf',
 'Final_NyayaBot_Project_Report_Revised_Abbu_Talib.pdf',
 'frm_download_file.pdf',
 'Git Cheat Sheet.pdf',
 'Git-2.45.1-64-bit.exe',
 'Golden Rules for solving a Coding Qn in an Interview.pdf',
 'HashMap & set.pdf',
 'HashMap - 2.pdf',
 'HashMap 1.pdf',
 'HashMap 2 (1).pdf',
 'Hashmap and Set Java.pdf',
 'History by Kaish Alam Sir 03.10.2024.pdf',
 'How To Imporove Programming Logic.pdf',
 'How to learn DSA.pdf',
 'Html Cheatsheet.pdf',
 'html.notes.pdf',
 'Image Gallery Project.zip',
 'images.jpg',
 'IMPORTANT DSA cheatsheet.pdf',
 'IMPORTANT DSA PROBLEMS List Backup.xlsx',
 'Introduction to Dp.pdf',
 'JAVA  Merge Sort.pdf',
 'JAVA  Quick Sort.pdf',
 'JAVA  Recursion 1.pdf',
 'JAVA  Recursion 2.pdf',
 'Java Basic Sorting.pdf',
 'Java Binary Search.pdf',
 'JAVA Methods (1).pdf',
 'JAVA Methods.pdf',
 'Java Recursion 1 (1).pdf',
 'Java Recursion 1.pdf',
 'Java T&C (1).pdf',
 'JAVA_Assigment_prefix_sum.pdf',
 'JAVA_sliding_window.pdf',
 'jdk-22_windows-x64_bin.exe',
 'js.notes.pdf',
 'kirana_shopping_data.csv',
 'Lecture1-Basics.zip',
 'Lecture2-TagPractice.zip',
 'Legal-Advice-Chatbots-Navigating-the-Risks (1).pdf',
 'Legal-Advice-Chatbots-Navigating-the-Risks.pdf',
 'Linked List-1 (1).pdf',
 'Linked List-1.pdf',
 'Linked List-2.pdf',
 'Linked List-3.pdf',
 'Linked_list-4.pdf',
 'Loop LP.pdf',
 'Loops.pdf',
 'LP Stack 3.pdf',
 'Machine_Learning_in_7_Hours_lyst1728638868665.pdf',
 'main.py',
 'Maps & Sets.pdf',
 'Marketing-and-Growth-Strategy.png',
 'Matplotlib1 (1).ipynb',
 'Matplotlib1.ipynb',
 'Mentora-The-Future-of-Coaching-is-Here.pdf',
 'Merge quick sorting lesson plan-20240515T062211Z-001.zip',
 'minor_project_-_report_(1)[1].docx',
 'minor_project_-_report_(1)[1].pdf',
 'Multidimensional Array.pdf',
 'Multidimensional Arrays.pdf',
 'nivas.jpg.pdf',
 'node-v20.17.0-x64.msi',
 'node-v22.16.0-x64.msi',
 'Notes for Coding Interview Questions .pdf',
 'NyayaBot_Extended_Synopsis_Abbu_Talib_Ansari.pdf',
 'NyayaBot_Project_Synopsis_Abbu_Talib_Ansari.pdf',
 'order_Nkcoyy1lt7jn18.pdf',
 'OS in 6 hours.pdf',
 'pandas_large_practice_data.csv',
 'pandas_practice_data.csv',
 'pandas_practice_notebook.py',
 'Pandas_Use_Cases_Full_Guide.pdf',
 'Pattern Printing (1).pdf',
 'payment receipt.pdf',
 'PERFECT 7 SEPTEMBER 2024 HINDI.pdf',
 'PHM-21 + PHM-18 Batch August Schedule 2024.pdf',
 'PHM-21 + PHM-18 Batch December Schedule 2024.pdf',
 'PHM-21 + PHM-18 Batch July Schedule 2024.pdf',
 'PHM-21 + PHM-18 Batch November Schedule 2024.pdf',
 'PHM-21 + PHM-18 Batch October Schedule 2024.pdf',
 'PHM-21 + PHM-18 Batch September Schedule 2024.pdf',
 'Portfolio Website [Codes].zip',
 'Prefix Sum Java.pdf',
 'Priority Queue-1 (1).pdf',
 'Priority Queue-1.pdf',
 'Priority Queue-2 (1).pdf',
 'Priority Queue-2.pdf',
 'Problem solving in DS and Algorithms.pdf',
 'Product Card Project.zip',
 'pwskills.com.html',
 'pwskills.com_files',
 'Python lab manual 4th sem for students.docx',
 'python-3.13.2-amd64.exe',
 'python-3.13.5-amd64.exe',
 'QP-CSM-23-ESSAY-180923.pdf',
 'QP-CSM-23-GENERAL-STUDIES-PAPER-I-180923.pdf',
 'QP-CSM-23-GENERAL-STUDIES-PAPER-II-180923.pdf',
 'QP-CSM-23-GENERAL-STUDIES-PAPER-III-180923.pdf',
 'QP-CSM-23-GENERAL-STUDIES-PAPER-IV-180923.pdf',
 'Queue - 1.pdf',
 'queue 2 questions.pdf',
 'react.notes.pdf',
 'README.md',
 'RealTime.py',
 'Research Hub Papers - May 23, 2025.csv',
 'Result PHM-12 & 21 History Prelims Test- 24.05.24 .pdf',
 'Result_History_Economy_Geography_Ecology_&_Env_&Current_Affairs.pdf',
 'Result_PHM_18,_21_&_PHE_13,_20_&_S_S_Governance_Mains_Test_29_11.pdf',
 'Result_PHM_18,_21_&_PHE_13,_20_&_S_S_Modern_History_Mains_Test_07.pdf',
 'Result_PHM_18,_21_&_PHE_13,_20_&_S_S_World_History_Mains_Test_19.pdf',
 'Result_PHM_18_&_PHM_21_Indian_Economy_Mains_Test_29_07_24.pdf',
 'Result_PHM_18_&_PHM_21_Indian_Society_&_Social_Justice_Mains_Test.pdf',
 'Result_PHM_18_&_PHM_21_Internal_Security_Mains_Test_07_07_24_.pdf',
 'Revised PHM-21 + PHM-18 Batch August Schedule 2024 - Copy.pdf',
 'rgi_logo1.png',
 'rgpv portal charge.pdf',
 'Roadmap to learn DSA from scratch.pdf',
 'Screenshot_15-11-2024_73741_docs.google.com.jpeg',
 'Screenshot_15-11-2024_73832_docs.google.com.jpeg',
 'Screenshot_15-11-2024_73848_docs.google.com.jpeg',
 'Screenshot_15-11-2024_7388_docs.google.com.jpeg',
 'Screenshot_15-11-2024_73926_docs.google.com.jpeg',
 'Screenshot_15-11-2024_7392_docs.google.com.jpeg',
 'Screenshot_15-11-2024_73938_docs.google.com.jpeg',
 'Screenshot_15-11-2024_73958_docs.google.com.jpeg',
 'Screenshot_15-11-2024_74040_docs.google.com.jpeg',
 'Screenshot_15-11-2024_74056_docs.google.com.jpeg',
 'Screenshot_15-11-2024_74110_docs.google.com.jpeg',
 'Screenshot_15-11-2024_74124_docs.google.com.jpeg',
 'Screenshot_15-11-2024_74139_docs.google.com.jpeg',
 'Screenshot_15-11-2024_74212_docs.google.com.jpeg',
 'Screenshot_15-11-2024_7421_docs.google.com.jpeg',
 'Screenshot_15-11-2024_74222_docs.google.com.jpeg',
 'Screenshot_25-7-2025_174443_localhost.jpeg',
 'SE practical .pdf',
 'shop_details.csv',
 'shop_details.json',
 'shop_details.xlsx',
 'Sliding Window Java.pdf',
 'stack 4 lp.pdf',
 'Stack.pdf',
 'Strings - 1.pdf',
 'Strings - 2.pdf',
 'Students_details.csv',
 'student_marks.csv',
 'Study Coding Effectively - Ashish .pdf',
 'syllabus.pdf',
 'Talib_Ansari_python_programming.ipynb',
 'Technology-Scalable-and-Intelligent.png',
 'Telegram Desktop',
 'terrorism types and efforts (Hindi).pdf',
 'Thank-You.png',
 'The-EduNest-Solution-Integrated-Learning-Platform.png',
 'The-Market-Opportunity-Indias-Booming-EdTech.png',
 'The-Team-and-Call-to-Action.png',
 'The-Vision-An-AI-Powered-E-Learning-Ecosystem (1).png',
 'The-Vision-An-AI-Powered-E-Learning-Ecosystem (2).png',
 'The-Vision-An-AI-Powered-E-Learning-Ecosystem.png',
 'Time and Space Complexity.pdf',
 'TOC_in_8_hours_lyst1728638567444.pdf',
 'tsetup-x64.5.5.5.exe',
 'UPSC Prelims Test Series (1).pdf',
 'UPSC Prelims Test Series.pdf',
 'UPSC _ Model Answer.pdf',
 'video6291851974509859733.mp4',
 'VSCodeUserSetup-x64-1.86.2.exe',
 'WhatsApp Image 2025-06-18 at 15.08.50_04ec0904.pdf',
 'WhatsApp Installer.exe',
 'wps_wid.cid-696606918.1754485030.exe']

In [17]:
dirct1='C:\\Users\\talib\\OneDrive\\Desktop'
os.chdir(dirct1)

In [18]:
os.getcwd()

'C:\\Users\\talib\\OneDrive\\Desktop'

In [19]:
os.listdir()

['Attachments',
 'CODING',
 'cricket_details.json',
 'cricket_details.xlsx',
 'desktop.ini',
 'employee_data.csv',
 'employee_data.json',
 'employee_data.xlsx',
 'indesx.html',
 'p1.py',
 'python',
 'shopping_data.csv',
 'shopping_data.json',
 'shopping_data.xlsx',
 'Tailwind',
 'Telegram.lnk',
 'Visual Studio Code.lnk',
 'WPS Office.lnk',
 'WPS PDF.lnk']

In [20]:
for item in os.listdir():
    print(item)

Attachments
CODING
cricket_details.json
cricket_details.xlsx
desktop.ini
employee_data.csv
employee_data.json
employee_data.xlsx
indesx.html
p1.py
python
shopping_data.csv
shopping_data.json
shopping_data.xlsx
Tailwind
Telegram.lnk
Visual Studio Code.lnk
WPS Office.lnk
WPS PDF.lnk

In [23]:
for item in os.listdir():
    name=item.split()
    print(name)

['Attachments']
['CODING']
['cricket_details.json']
['cricket_details.xlsx']
['desktop.ini']
['employee_data.csv']
['employee_data.json']
['employee_data.xlsx']
['indesx.html']
['p1.py']
['python']
['shopping_data.csv']
['shopping_data.json']
['shopping_data.xlsx']
['Tailwind']
['Telegram.lnk']
['Visual', 'Studio', 'Code.lnk']
['WPS', 'Office.lnk']
['WPS', 'PDF.lnk']

In [24]:
for item in os.listdir():
    if ".csv" in item:
        print(item)

employee_data.csv
shopping_data.csv

In [25]:
for item in os.listdir():
    if ".csv" in item:
        print(item)
        break

employee_data.csv

In [26]:
for item in os.listdir():
    if ".csv" in item:
        print(None)
    print(item)

Attachments
CODING
cricket_details.json
cricket_details.xlsx
desktop.ini
None
employee_data.csv
employee_data.json
employee_data.xlsx
indesx.html
p1.py
python
None
shopping_data.csv
shopping_data.json
shopping_data.xlsx
Tailwind
Telegram.lnk
Visual Studio Code.lnk
WPS Office.lnk
WPS PDF.lnk

In [34]:
import os
list_directory=os.listdir()
name=''
ext=''
#print(list_directory)
for file in list_directory:
    if ".csv" in file:
        name,ext=file.split('.')
name.to_csv("name.csv",index=False)

AttributeError: 'str' object has no attribute 'to_csv'

In [52]:
import pandas as pd
import os
list_directory=os.listdir()
name=''
ext=''
#print(list_directory)
for file in list_directory:
    if ".csv" in file:
        df=pd.read_csv(file)
        name,ext=file.split('.')
name.to_json(r'C:\Users\talib\Downloads\name_data.json',index=False)

AttributeError: 'str' object has no attribute 'to_json'

In [54]:
import pandas as pd
import os
list_directory=os.listdir()
df=None
#print(list_directory)
for file in list_directory:
    if ".csv" in file:
        df=pd.read_csv(file)
df.to_json(r'C:\Users\talib\Downloads\df_data.json',index=False)

In [56]:
import pandas as pd
import os
list_directory=os.listdir()
for file in list_directory:
    if file.endswith(".csv"):
        df=pd.read_csv(file)
df.to_json(r"C:\Users\talib\Downloads\df_data.json",orient="records")

In [57]:
import pandas as pd
df=pd.read_csv("staff_details.csv")
df

FileNotFoundError: [Errno 2] No such file or directory: 'staff_details.csv'